; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph5 - mode
	image1 - mode
	infrared6 - mode
	thermograph0 - mode
	infrared2 - mode
	image3 - mode
	infrared4 - mode
	Star2 - direction
	GroundStation7 - direction
	Star8 - direction
	Star10 - direction
	Star12 - direction
	Star9 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation11 - direction
	Star3 - direction
	Star1 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star9)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared6)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Star13 infrared4)
	(have_image Planet14 image3)
	(have_image Planet14 infrared6)
	(have_image Planet15 infrared6)
	(have_image Planet16 infrared6)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 planet14 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 planet14)
   goals met: 0 of 6
5. (take_image satellite1 planet14 instrument2 infrared6)
   added: (have_image planet14 infrared6)
   goals met: 1 of 6
6. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 1 of 6
7. (take_image satellite1 planet15 instrument2 infrared6)
   added: (have_image planet15 infrared6)
   goals met: 2 of 6
8. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 2 of 6
9. (take_image satellite1 planet16 instrument2 infrared6)
   added: (have_image planet16 infrared6)
   goals met: 3 of 6
10. (turn_to satellite1 star13 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star13)
   goals met: 3 of 6
11. (take_image satellite1 star13 instrument2 infrared4)
   added: (have_image star13 infrared4)
   goals met: 4 of 6
12. (turn_to satellite0 groundstation6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 6
13. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 4 of 6
14. (turn_to satellite0 planet14 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 planet14)
   goals met: 4 of 6
15. (take_image satellite0 planet14 instrument1 image3)
   added: (have_image planet14 image3)
   goals met: 5 of 6
16. (turn_to satellite0 star2 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star2)
   goals met: 6 of 6
